DataProcessors/сви_СинхронизацияХорошоп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>сви_СинхронизацияХорошоп</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сви_СхемыОбменаССайтом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/мпи_ЗначенияКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>мпи_ЗначенияКатегорийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКатегории</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.мпи_ВидыКатегорийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мпи_КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьШтрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКачество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Comment>Поле в котором хранится числовое значение телефонного номера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/сви_ВидыХраненияКатегорийСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>сви_ВидыХраненияКатегорийСайта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорииНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/сви_ВидыРеквизитовСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>сви_ВидыРеквизитовСайта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Модификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Характеристика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/сви_СинхронизацияХорошоп/Ext/ObjectModule.bsl
//ФинЛайт добавление функциональности big_ooo [12.01.2017]
Процедура ЗагрузкаКатегорий(Обновить=Ложь) Экспорт
	
	КодЯзыка = ?(ЗначениеЗаполнено(СхемаОбмена.КодЯзыка),СхемаОбмена.КодЯзыка,"ru");
	
    НастройкиПодключений = СхемаОбмена.НастройкаПодключения;
	//СхемаОбмена = Подразделение.сви_СхемаОбменаССайтом;
    
    ТокенРез = мпи_Доработки.ПолучитьТокен_Хорошоп(НастройкиПодключений); 
    
    Если ТокенРез.Статус = "OK" Тогда
    	ТокенСтр = ТокенРез.Токен; 
    Иначе
    	Сообщить(ТокенРез.Сообщение);
    	Возврат;
    КонецЕсли;
	
	
	ПараметрыПОСТ = "token=#token#";
	ПараметрыПОСТ = СтрЗаменить(ПараметрыПОСТ,"#token#",ТокенСтр);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Language", "ru");
	Заголовки.Вставить("Accept-Charset",  "UTF-8");
	Заголовки.Вставить("Content-Language","ru");
	Заголовки.Вставить("Content-Charset", "UTF-8");
	Заголовки.Вставить("Content-Type",    "application/x-www-form-urlencoded; charset=UTF-8");
	
	Адрес = НастройкиПодключений.Адрес;
	ПутьНаСервере = "/"+НастройкиПодключений.АдресСкриптаЗагрузкаКатегорий;
	
	HTTPЗапрос = Новый HTTPЗапрос(ПутьНаСервере,Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыПОСТ,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
	
	Соединение = мпи_Доработки.СоздатьHTTPСоединение(НастройкиПодключений);

	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	
	_Текст = Новый ТекстовыйДокумент;
	_Текст.ДобавитьСтроку(ТекстОтвета);
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		_Текст.Записать(СхемаОбмена.ПапкаФайлаЛога + "hs_pages_answ.json");
	Иначе
		_Текст.Записать(ПолучитьИмяВременногоФайла("json"));
	КонецЕсли;
	
	
	ЧтениеДЖС = Новый ЧтениеJSON;
	ЧтениеДЖС.УстановитьСтроку(ТекстОтвета);
	
	Строки = ПрочитатьJSON(ЧтениеДЖС);
	
	Если НЕ (Строки.status = "OK") Тогда
		Сообщить("Ошибка. "+Строки.response.message);
		Возврат;
	КонецЕсли;
	
	МассивиКатегорий = Строки.response.pages;
	//ФинЛайт добавление функциональности big_ooo [20.01.2017]
	кодКорня = 0;
	кодОсновнойГруппы = 0;
	//найдем корень
	Для каждого текКатегория Из МассивиКатегорий Цикл
		КодГруппы = мпи_Доработки.УбратьШлакИзСтроки(текКатегория.id);
		КодРодителя = мпи_Доработки.УбратьШлакИзСтроки(текКатегория.parent);
		Наименование = СокрЛП(текКатегория.title[КодЯзыка]);
		Если Наименование = СхемаОбмена.ИмяКорняКаталогаТоваровНаСайте Тогда
			//запоминаем код родителя 
			кодКорня = КодРодителя;
			кодОсновнойГруппы = КодГруппы;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//удалим лишние страницы
	мДляУдаления = Новый Массив;
	Для каждого текКатегория Из МассивиКатегорий Цикл
		КодГруппы = мпи_Доработки.УбратьШлакИзСтроки(текКатегория.id);
		КодРодителя = мпи_Доработки.УбратьШлакИзСтроки(текКатегория.parent);
		Если (КодРодителя = кодКорня и КодГруппы <>кодОсновнойГруппы) Или КодРодителя = "0" Тогда
			мДляУдаления.Добавить(текКатегория);
		КонецЕсли;
	КонецЦикла;
	Для каждого текЭл Из мДляУдаления Цикл
		поз =  МассивиКатегорий.Найти(текЭл);
		Если поз <> Неопределено Тогда
			МассивиКатегорий.Удалить(поз);			
		КонецЕсли;
		
	КонецЦикла;
	// } ФинЛайт big_ooo [20.01.2017]
	
	Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.КатегорииНоменклатуры ТОгда	
		ВидКатегорий = СхемаОбмена.ВидКатегорийНоменклатуры;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	мпи_КатегорииНоменклатуры.КодВэбСинхронизации,
		|	мпи_КатегорииНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.мпи_КатегорииНоменклатуры КАК мпи_КатегорииНоменклатуры
		|ГДЕ
		|	мпи_КатегорииНоменклатуры.Владелец = &Владелец
		|	И мпи_КатегорииНоменклатуры.КодВэбСинхронизации <> """"";
		Запрос.УстановитьПараметр("Владелец", ВидКатегорий);
		ТаблКатегорий = Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
		
	Для Каждого узКатегория ИЗ МассивиКатегорий Цикл
		КодГруппы = мпи_Доработки.УбратьШлакИзСтроки(узКатегория.id);
		КодРодителя = мпи_Доработки.УбратьШлакИзСтроки(узКатегория.parent);
		Наименование = СокрЛП(узКатегория.title[КодЯзыка]);
		
		Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.ГруппыНоменклатуры ТОгда
			текГруппа = НайтиРодителя(КодГруппы);
			///// ===
			Если Не ЗначениеЗаполнено(текГруппа) Тогда
				НовСпр = Справочники.Номенклатура.СоздатьГруппу();
				фСоздавать = Истина;
			Иначе
				Если НЕ Обновить Тогда   //если найдена группа и не нужно обновлять а только добавлять новые
					Продолжить;
				КонецЕсли;
				НовСпр = текГруппа.ПолучитьОбъект();
				фСоздавать = Ложь;
			КонецЕсли;
			НовСпр.Наименование = Наименование;
			НовСпр.Родитель 	= НайтиРодителя(КодРодителя);
			НовСпр.сви_КодВэбСинхронизации = КодГруппы;
			НовСпр.Записать();
			Если фСоздавать Тогда
				Сообщить("Создана новая группа : "+Наименование+"("+НовСпр.Код+")");
			Иначе
				Сообщить("Обновлена группа : "+Наименование+"("+НовСпр.Код+")");
			КонецЕсли;
		ИначеЕсли СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.КатегорииНоменклатуры ТОгда	
			СтрокаТаблКатегорий = ТаблКатегорий.Найти(КодГруппы, "КодВэбСинхронизации");
			Если СтрокаТаблКатегорий = Неопределено ТОгда
				НовКатегория = Справочники.мпи_КатегорииНоменклатуры.СоздатьЭлемент();
				НовКатегория.Владелец = ВидКатегорий;
				НовКатегория.Наименование = Наименование;
				НовКатегория.КодВэбСинхронизации = КодГруппы;
				СсылкаРодителя = Справочники.мпи_КатегорииНоменклатуры.ПустаяСсылка();
				Если ЗначениеЗаполнено(КодРодителя) ТОгда
					СтрокаТаблКатегорийРодитель = ТаблКатегорий.Найти(КодРодителя, "КодВэбСинхронизации");
					Если СтрокаТаблКатегорийРодитель <> Неопределено Тогда
						СсылкаРодителя = СтрокаТаблКатегорийРодитель.Ссылка;
					КонецЕсли;	
				КонецЕсли;
				НовКатегория.Родитель = СсылкаРодителя;
				НовКатегория.Записать();
				
				НовСтр = ТаблКатегорий.Добавить();
				НовСтр.Ссылка = НовКатегория.Ссылка;
				НовСтр.КодВэбСинхронизации = КодГруппы;
			Иначе
				Если НЕ Обновить Тогда   //если найдена группа и не нужно обновлять а только добавлять новые
					Продолжить;
				КонецЕсли;
				
				КатегорияОбъект = СтрокаТаблКатегорий.Ссылка.ПолучитьОбъект();
				ЕстьИзменения = Ложь;
				Если КатегорияОбъект.Наименование <> Наименование Тогда
					КатегорияОбъект.Наименование = Наименование;
					ЕстьИзменения = Истина;
				КонецЕсли;	
				СсылкаРодителя = Справочники.мпи_КатегорииНоменклатуры.ПустаяСсылка();
				Если ЗначениеЗаполнено(КодРодителя) ТОгда
					СтрокаТаблКатегорийРодитель = ТаблКатегорий.Найти(КодРодителя, "КодВэбСинхронизации");
					Если СтрокаТаблКатегорийРодитель <> Неопределено Тогда
						СсылкаРодителя = СтрокаТаблКатегорийРодитель.Ссылка;
					КонецЕсли;	
				КонецЕсли;
				Если КатегорияОбъект.Родитель <> СсылкаРодителя Тогда
					КатегорияОбъект.Родитель = СсылкаРодителя;
					ЕстьИзменения = Истина;
				КонецЕсли;	
				Если ЕстьИзменения ТОгда
					КатегорияОбъект.Записать();
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры


//ФинЛайт добавление функциональности big_ooo [12.01.2017]
Функция НайтиРодителя(КодРодителя) Экспорт
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = Истина
	|	И Номенклатура.сви_КодВэбСинхронизации = &КодВэбСинхронизации"
	;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("КодВэбСинхронизации",КодРодителя);
	Выборка = Запрос.Выполнить().Выбрать();
	текГруппа = Неопределено;
	Если Выборка.Следующий() Тогда
		текГруппа = Выборка.Ссылка;
	КонецЕсли;
	Возврат текГруппа;
КонецФункции

Функция ПолучитьНоменклатуруССайта(Обновить)
	КодЯзыка = ?(ЗначениеЗаполнено(СхемаОбмена.КодЯзыка),СхемаОбмена.КодЯзыка,"ru");
	
	НастройкиПодключений = СхемаОбмена.НастройкаПодключения;
	//СхемаОбмена = Подразделение.сви_СхемаОбменаССайтом;
	
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	тТовары = Новый ТаблицаЗначений;
	тТовары.Колонки.Добавить("ИД",ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(25));
	//тТовары.Колонки.Добавить("флРодительскийАртикул");
	тТовары.Колонки.Добавить("Наименование");
	тТовары.Колонки.Добавить("ДополнительноеОписаниеНоменклатуры");
	тТовары.Колонки.Добавить("КодРодителя");
	тТовары.Колонки.Добавить("Цена",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	тТовары.Колонки.Добавить("ЦенаРРЦ",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	тТовары.Колонки.Добавить("ЦенаСтарая",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	тТовары.Колонки.Добавить("Валюта");

	Если СхемаОбмена.ЗагружатьСвойстваНоменклатурыССайта Тогда
		тТовары.Колонки.Добавить("СвойстваНоменклатуры"); //++
	КонецЕсли;
	
	тТовары.Колонки.Добавить("Ссылка");
	
	ТокенРез = мпи_Доработки.ПолучитьТокен_Хорошоп(НастройкиПодключений); 
	
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Сообщить(ТокенРез.Сообщение);
		Возврат Неопределено;
	КонецЕсли;
	
	Соединение = мпи_Доработки.СоздатьHTTPСоединение(НастройкиПодключений);
	
	Смещение = 0; Лиммит = 500;
	
	ТегНаименования = СхемаОбмена.ТегНаименования;
	
	Пока Истина Цикл
		
		ПараметрыПОСТ = "token=#token#&offset=#offset#&limit=#limit#";
		ПараметрыПОСТ = СтрЗаменить(ПараметрыПОСТ,"#token#",ТокенСтр);
		ПараметрыПОСТ = СтрЗаменить(ПараметрыПОСТ,"#offset#",мпи_Доработки.УбратьШлакИзСтроки(Формат(Смещение,"ЧГ=0")));
		ПараметрыПОСТ = СтрЗаменить(ПараметрыПОСТ,"#limit#", мпи_Доработки.УбратьШлакИзСтроки(Формат(Лиммит,"ЧГ=0")));
		
		Заголовки = Новый Соответствие();
		Заголовки.Вставить("Accept-Language", "ru");
		Заголовки.Вставить("Accept-Charset",  "UTF-8");
		Заголовки.Вставить("Content-Language","ru");
		Заголовки.Вставить("Content-Charset", "UTF-8");
		//Заголовки.Вставить("Content-Type","application/json");
        Заголовки.Вставить("Content-Type",    "application/x-www-form-urlencoded; charset=UTF-8");
		
		АдресСкриптаЗагрузкаТоваров = "/"+НастройкиПодключений.АдресСкриптаЗагрузкаТоваров;
		
		HTTPЗапрос = Новый HTTPЗапрос(АдресСкриптаЗагрузкаТоваров,Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыПОСТ,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");

		
		_Текст = Новый ТекстовыйДокумент;
		_Текст.ДобавитьСтроку(ТекстОтвета);
		Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
			_Текст.Записать(СхемаОбмена.ПапкаФайлаЛога + "hs_in_goods_answ.json");
		Иначе
			_Текст.Записать(ПолучитьИмяВременногоФайла("json"));
		КонецЕсли;
		
		// Нужно удалять глюкавые символосочетания, но не трогать их если есть двойной слеш
		
		_замена = "\f"; 
		
		Если Найти (ТекстОтвета,"\"+_замена) = 0 Тогда 
			ТекстОтвета = СтрЗаменить(ТекстОтвета,_замена,"");
		КонецЕсли;
		
		_замена = "\b"; 
		Если Найти(ТекстОтвета,"\"+_замена) = 0 Тогда 
			ТекстОтвета = СтрЗаменить(ТекстОтвета,_замена,"");
		КонецЕсли;
		
		_замена = "\t"; 
		Если Найти(ТекстОтвета,"\"+_замена) = 0 Тогда 
			ТекстОтвета = СтрЗаменить(ТекстОтвета,_замена,"");
		КонецЕсли;
		
		ЧтениеДЖС = Новый ЧтениеJSON;
		ЧтениеДЖС.УстановитьСтроку(ТекстОтвета);
				
		//Если Не ЗначениеЗаполнено(ТекстОтвета) Тогда
		//	Прервать;
		//КонецЕсли;	
		
		Строки = ПрочитатьJSON(ЧтениеДЖС,Истина);
		
		Если НЕ (Строки.Получить("status") = "OK") Тогда
			Сообщить("Ошибка.");
			Возврат Неопределено;
		КонецЕсли;
				
		МассивТоваров = Строки.Получить("response").Получить("products");
		
		Если МассивТоваров.Количество() = 0 Тогда
			фКонецЦикла = Истина;
			Прервать;
		КонецЕсли;	
		
		Для Каждого узТовар ИЗ МассивТоваров Цикл
			Если ТипЗнч(узТовар["article"]) = Тип("Число") Тогда
				ИД = мпи_Доработки.УбратьШлакИзСтроки(Формат(узТовар["article"], "ЧРД=."));
			Иначе
				ИД = мпи_Доработки.УбратьШлакИзСтроки(узТовар["article"]);
			КонецЕсли;
			//
			Если Не Обновить Тогда //добавляем только новые
				Товар = НайтиЭлементСПР("Номенклатура",ИмяРеквизитаИдентификатора,ИД);
				Если ЗначениеЗаполнено(Товар) Тогда
					Продолжить; //пропускаем те что уже есть в базе
				КонецЕсли;
			КонецЕсли;
			//
			НовСтр = тТовары.Добавить();
			НовСтр.ИД = ИД;
			//НовСтр.флРодительскийАртикул = флДоработки.УбратьШлакИзСтроки(узТовар["parent_article"]);
			
			title = узТовар ["title"] [КодЯзыка];
			mod_title = узТовар ["mod_title"] [КодЯзыка];
			
			Если ТегНаименования = "title" Тогда
				НовСтр.Наименование = title;
			ИначеЕсли ТегНаименования = "mod_title" Тогда
				НовСтр.Наименование = mod_title;
			Иначе
				Если ЗначениеЗаполнено(mod_title) Тогда
					НовСтр.Наименование = mod_title;
				Иначе
					НовСтр.Наименование = title;
				КонецЕсли;
			КонецЕсли;	
				
			НовСтр.КодРодителя  = мпи_Доработки.УбратьШлакИзСтроки(Строка(узТовар ["parent"]["id"]) );
			НовСтр.ДополнительноеОписаниеНоменклатуры = узТовар ["description"] [КодЯзыка];
			
			НовСтр.Цена					= узТовар["price"];
			НовСтр.ЦенаСтарая			= узТовар["price_old"];
			НовСтр.Валюта				= узТовар["currency"]["value"];
			
			//++ Раздел characteristcs
			Если СхемаОбмена.ЗагружатьСвойстваНоменклатурыССайта Тогда
				ТаблицаСвойств = Новый ТаблицаЗначений;
				ТаблицаСвойств.Колонки.Добавить("ИмяСвойства");
				ТаблицаСвойств.Колонки.Добавить("ЗначениеСвойства");
				
				Для Каждого ТекСвойство Из узТовар["characteristics"] Цикл
					НС = ТаблицаСвойств.Добавить();
					НС.ИмяСвойства = ТекСвойство.Ключ;
					НС.ЗначениеСвойства = ТекСвойство.Значение [КодЯзыка]; 
				КонецЦикла;
				НовСтр.СвойстваНоменклатуры = ТаблицаСвойств;
			КонецЕсли;
		КонецЦикла;
		
		Смещение = Смещение + Лиммит;
		
		//Сообщить(Смещение);
		
		//Прервать;
		
	КонецЦикла;
	
	Сообщить("Всего товаров : "+тТовары.Количество());
	
	Возврат тТовары;
КонецФункции

Процедура ЗагрузкаНоменклатуры(Обновить=Ложь) Экспорт
	
	НастройкиПодключений = СхемаОбмена.НастройкаПодключения;
	//СхемаОбмена = Подразделение.сви_СхемаОбменаССайтом;
	
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	тТовары = ПолучитьНоменклатуруССайта(Обновить);
	
	Если тТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ВременнаяГруппа = Справочники.Номенклатура.НайтиПоКоду("00000011066");
	
	КвоНовых = 0;
	
	Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.КатегорииНоменклатуры ТОгда	
		ВидКатегорий = СхемаОбмена.ВидКатегорийНоменклатуры;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	мпи_КатегорииНоменклатуры.КодВэбСинхронизации,
		|	мпи_КатегорииНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.мпи_КатегорииНоменклатуры КАК мпи_КатегорииНоменклатуры
		|ГДЕ
		|	мпи_КатегорииНоменклатуры.Владелец = &Владелец
		|	И мпи_КатегорииНоменклатуры.КодВэбСинхронизации <> """"";
		Запрос.УстановитьПараметр("Владелец", ВидКатегорий);
		ТаблКатегорий = Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
	
	Для Каждого Стр ИЗ тТовары Цикл
		Товар = НайтиЭлементСПР("Номенклатура",ИмяРеквизитаИдентификатора,Стр.ИД);
		фСоздавать = Ложь;
		Если ЗначениеЗаполнено(Товар) Тогда
			НовСпр = Товар.ПолучитьОбъект();
		Иначе
			НовСпр = Справочники.Номенклатура.СоздатьЭлемент();
			фСоздавать = Истина;
		КонецЕсли;
		
		//реквизиты сайта
		ЗаполнитьЗначенияСвойств(НовСпр,Стр);
		//
		Если НЕ ИмяРеквизитаИдентификатора = "Штрихкод" Тогда
			НовСпр[ИмяРеквизитаИдентификатора] = Стр.ИД;
		КонецЕсли;
		
		НовСпр.Наименование 		= Стр.Наименование;
		НовСпр.НаименованиеПолное 	= НовСпр.Наименование;
		
		Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.ГруппыНоменклатуры Тогда
			НовСпр.Родитель = НайтиРодителя(Стр.КодРодителя);
		Иначе
			//Записываем номенклатуру в отдельную группу определенную в схеме синхронизации
			НовСпр.Родитель = СхемаОбмена.ГруппаНоменклатурыПриЗагрузкеИзСайта;
		КонецЕсли;	
		//реквизиты по умолч
		Если фСоздавать Тогда
			НовСпр.БазоваяЕдиницаИзмерения = СхемаОбмена.БазоваяЕдиницаИзмерения; //УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяЕдиницаПоКлассификатору");
			НовСпр.СтавкаНДС = СхемаОбмена.СтавкаНДС; //УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяСтавкаНДС");
			НовСпр.ВидНоменклатуры = СхемаОбмена.ВидНоменклатуры;
			НовСпр.Услуга   = (НовСпр.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга);
			НовСпр.Набор    = (НовСпр.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор);
			НовСпр.Комплект = (НовСпр.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Комплект);
			НовСпр.Записать();
			//добавляю единицы
			НайденнаяЕдиницаОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			НайденнаяЕдиницаОбъект.Наименование            = СокрЛП(НовСпр.БазоваяЕдиницаИзмерения);
			НайденнаяЕдиницаОбъект.ЕдиницаПоКлассификатору = НовСпр.БазоваяЕдиницаИзмерения;
			НайденнаяЕдиницаОбъект.Коэффициент             = 1;
			НайденнаяЕдиницаОбъект.Владелец                = НовСпр.Ссылка;
			
			Попытка
				НайденнаяЕдиницаОбъект.Записать();
			Исключение
				Сообщить("Не удалось записать единицу хранения остатков: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;
			НовСпр.ЕдиницаХраненияОстатков = НайденнаяЕдиницаОбъект.Ссылка;
			НовСпр.ЕдиницаДляОтчетов = НовСпр.ЕдиницаХраненияОстатков;
		КонецЕсли;	
		
		НовСпр.ДополнительноеОписаниеНоменклатуры = СокрЛП(Стр.ДополнительноеОписаниеНоменклатуры);
		//++ Дополнительное описание в форматированный документ
		Если НЕ СокрЛП(Стр.ДополнительноеОписаниеНоменклатуры) = "" Тогда
			
			СтрокаФорматированногоОписания = "<HTML><HEAD>
				|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
				|<META name=GENERATOR content=""MSHTML 11.00.9600.17842""></HEAD>
				|<BODY>" 
				+ Стр.ДополнительноеОписаниеНоменклатуры 
				+ "</BODY></HTML>";
				
			НовСпр.ФорматированноеОписание = Новый ХранилищеЗначения (СтрокаФорматированногоОписания);
		КонецЕсли;
		
		НовСпр.Записать();
		
		//++ Свойства номенклатуры
		Если СхемаОбмена.ЗагружатьСвойстваНоменклатурыССайта Тогда
			
			//Очистим свойства перед обновлением
			Набор = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
			Набор.Отбор.Объект.Установить (НовСпр.Ссылка);
			Набор.Прочитать();
			
			мУС = Новый Массив;
			Для Каждого ТекЗапись Из Набор Цикл
				Если НЕ ТекЗапись.Свойство.сви_СинхронизироватьССайтом Тогда
					Продолжить;
				КонецЕсли;
				НайдСтроки = Стр.СвойстваНоменклатуры.НайтиСтроки (Новый Структура ("ИмяСвойства", ТекЗапись.Свойство.Наименование));
				Если НайдСтроки.Количество() = 0 Тогда
					мУС.Добавить(ТекЗапись);
				ИначеЕсли НайдСтроки[0].ЗначениеСвойства = "" Тогда
					мУС.Добавить(ТекЗапись);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого УС Из мУС Цикл
				Набор.Удалить(УС);
			КонецЦикла;
			Набор.Записать();
			
			Для Каждого ТекСвойство Из Стр.СвойстваНоменклатуры Цикл
				
				ЗаписатьСвойствоДляНоменклатуры(НовСпр.Ссылка, ТекСвойство.ИмяСвойства, ТекСвойство.ЗначениеСвойства);
				
			КонецЦикла;
		КонецЕсли;
		//--
		Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.КатегорииНоменклатуры ТОгда
			Если ЗначениеЗаполнено(Стр.КодРодителя) Тогда
				СтрокаТаблКатегорий = ТаблКатегорий.Найти(Стр.КодРодителя, "КодВэбСинхронизации");
				Если СтрокаТаблКатегорий <> Неопределено Тогда
					//Проверим. Если Есть несколько категорий, то надо для первой основную установить
					НЗ = РегистрыСведений.мпи_ЗначенияКатегорийНоменклатуры.СоздатьНаборЗаписей();
					НЗ.Отбор.НоменклатураОбъект.Установить(НовСпр.Ссылка);
					НЗ.Прочитать();
					Если НЗ.Количество() Тогда
						Основная = Ложь;
					Иначе
						Основная = Истина;
					КонецЕсли;	
					
					МЗ = РегистрыСведений.мпи_ЗначенияКатегорийНоменклатуры.СоздатьМенеджерЗаписи();
					МЗ.НоменклатураОбъект = НовСпр.Ссылка;
					МЗ.ВидКатегории = ВидКатегорий;
					МЗ.Значение = СтрокаТаблКатегорий.Ссылка;
					МЗ.Основная = Основная;
					МЗ.Записать();
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
		
		Если ИмяРеквизитаИдентификатора = "Штрихкод" Тогда
			МЗ = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			МЗ.Владелец = НовСпр.Ссылка;
			МЗ.Штрихкод = Стр.ИД;
			МЗ.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
			МЗ.Качество = Справочники.Качество.Новый;
			МЗ.Записать();
		КонецЕсли;	
		
		Если фСоздавать Тогда
			Сообщить("Создан новый товар: "+НовСпр.Наименование+" Код : "+НовСпр.Код);
		Иначе
			Сообщить("Обновлен товар: "+НовСпр.Наименование+" Код : "+НовСпр.Код);
		КонецЕсли;
		КвоНовых = КвоНовых + 1;
		//ОбработкаПрерыванияПользователя();
	КонецЦикла;
	
	Сообщить("Создано товаров : "+КвоНовых);
	
КонецПроцедуры

Процедура ЗаписатьСвойствоДляНоменклатуры (НомСсылка, ИмяСвойства, ЗначениеСвойства)
	
	Если СокрЛП(ЗначениеСвойства) = "" Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеСвойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоРеквизиту("сви_КодВэбСинхронизации", ИмяСвойства);
	Если НЕ ЗначениеЗаполнено(НайденноеСвойство) Тогда
		СвойствоОбъект = ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
		СвойствоОбъект.Наименование = ИмяСвойства;
		СвойствоОбъект.сви_КодВэбСинхронизации = ИмяСвойства;
		СвойствоОбъект.сви_ВидРеквизитаНаСайте = Перечисления.сви_ВидыРеквизитовСайта.Характеристика;
		СвойствоОбъект.сви_СинхронизироватьССайтом = Истина;
		СвойствоОбъект.НазначениеСвойства = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура;
		СвойствоОбъект.ТипЗначения = Новый ОписаниеТипов ("СправочникСсылка.ЗначенияСвойствОбъектов");
		СвойствоОбъект.Записать();
		НайденноеСвойство = СвойствоОбъект.Ссылка;
	КонецЕсли;
	
	ЗначениеСвойстваСсылка = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ЗначениеСвойства,Истина,,НайденноеСвойство);
	Если НЕ ЗначениеЗаполнено(ЗначениеСвойстваСсылка) Тогда
		Если СокрЛП(ЗначениеСвойства) = "" Тогда
			ЗначениеСвойстваСсылка = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
		Иначе
			ЗначениеСвойстваОбъект = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			ЗначениеСвойстваОбъект.Наименование = ЗначениеСвойства;
			ЗначениеСвойстваОбъект.Владелец = НайденноеСвойство;
			ЗначениеСвойстваОбъект.Записать();
	    	ЗначениеСвойстваСсылка = ЗначениеСвойстваОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	МЗ.Объект = НомСсылка;
	МЗ.Свойство = НайденноеСвойство;
	МЗ.Прочитать();
	
	Если НЕ МЗ.Значение = ЗначениеСвойстваСсылка Тогда
		МЗ.Объект = НомСсылка;
		МЗ.Свойство = НайденноеСвойство;
		МЗ.Значение = ЗначениеСвойстваСсылка;
		МЗ.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

//ФинЛайт добавление функциональности big_ooo [13.02.2017]
Процедура ЗагрузитьЦеныНоменклатуры() Экспорт
	
	НастройкиПодключений = СхемаОбмена.НастройкаПодключения;
	//СхемаОбмена = Подразделение.сви_СхемаОбменаССайтом;
	
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	тТовары = ПолучитьНоменклатуруССайта(Истина);
	
	Если тТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ВременнаяГруппа = Справочники.Номенклатура.НайтиПоКоду("00000011066");
	
	КвоНовых = 0;
	НовДокПрайс = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	НовДокПрайс.Дата = ТекущаяДата();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(НовДокПрайс, глЗначениеПеременной("глТекущийПользователь"));
	//добавим наши типы цен
	НовСтр = НовДокПрайс.ТипыЦен.Добавить();
	НовСтр.ТипЦен = СхемаОбмена.ТипЦеныПрайс;
	//
	НовДокСтарая = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	НовДокСтарая.Дата = ТекущаяДата();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(НовДокСтарая, глЗначениеПеременной("глТекущийПользователь"));
	НовДокСтарая.НеПроводитьНулевыеЗначения = Истина;
	//
	НовСтр = НовДокСтарая.ТипыЦен.Добавить();
	НовСтр.ТипЦен = СхемаОбмена.ТипЦеныСтарая;
	
	Для Каждого Стр ИЗ тТовары Цикл
		Товар = НайтиЭлементСПР("Номенклатура",ИмяРеквизитаИдентификатора,Стр.ИД);
		ВалютаСайт = стр.Валюта;
		Если валютаСайт = "UAH" Тогда
			Валюта = НовДокПрайс.мВалютаРегламентированногоУчета;
		Иначе
			Валюта = Справочники.Валюты.НайтиПоРеквизиту("КодВебСинхронизации", валютаСайт);
			Если Не ЗначениеЗаполнено(Валюта) Тогда
				Валюта = НайтиВСпрПоНаим("Валюты",валютаСайт);
			КонецЕсли;
		КонецЕсли;
		Данные = Новый Структура;
		Данные.Вставить("Номенклатура",Товар);
		Данные.Вставить("ЕдиницаИзмерения",Товар.ЕдиницаХраненияОстатков);
		Данные.Вставить("Валюта",Валюта);
		//
		Данные.Вставить("Цена",Стр.Цена);
		Данные.Вставить("ТипЦен",СхемаОбмена.ТипЦеныПрайс);
		ДобавитьНоменклатуруТабличнуюЧастьОценки(НовДокПрайс,Данные);
		//
		Данные.Вставить("Цена",Стр.ЦенаСтарая);
		Данные.Вставить("ТипЦен",СхемаОбмена.ТипЦеныСтарая);
		ДобавитьНоменклатуруТабличнуюЧастьОценки(НовДокСтарая,Данные);
		
		//ОбработкаПрерыванияПользователя();
	КонецЦикла;
	НовДокПрайс.Записать();
	Сообщить("Создан документ "+НовДокПрайс.Ссылка);
	Попытка
		НовДокПрайс.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	    Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
	НовДокСтарая.Записать();
	Сообщить("Создан документ "+НовДокСтарая.Ссылка);
	Попытка
		НовДокСтарая.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	    Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	КонецПопытки;
КонецПроцедуры
// } ФинЛайт big_ooo [13.02.2017]

Процедура ДобавитьНоменклатуруТабличнуюЧастьОценки(НовДок,Данные)
	НовСтр = НовДок.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтр,Данные);
КонецПроцедуры
                                                      
Процедура ЗагрузкаКонтрагентов(Обновить=Ложь) Экспорт
	
	КодЯзыка = ?(ЗначениеЗаполнено(СхемаОбмена.КодЯзыка),СхемаОбмена.КодЯзыка,"ru");
	
	НастройкиПодключений = СхемаОбмена.НастройкаПодключения;
	//СхемаОбмена = 	Подразделение.сви_СхемаОбменаССайтом;
	ТокенРез = мпи_Доработки.ПолучитьТокен_Хорошоп(НастройкиПодключений); 
	
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Сообщить(ТокенРез.Сообщение);
		Возврат;
	КонецЕсли;
	
		
	ПараметрыПОСТ = "token=#token#";
	ПараметрыПОСТ = СтрЗаменить(ПараметрыПОСТ,"#token#",ТокенСтр);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Language", "ru");
	Заголовки.Вставить("Accept-Charset",  "UTF-8");
	Заголовки.Вставить("Content-Language","ru");
	Заголовки.Вставить("Content-Charset", "UTF-8");
	//Заголовки.Вставить("Content-Type","application/json");
	Заголовки.Вставить("Content-Type",    "application/x-www-form-urlencoded; charset=UTF-8");
	
	АдресСкриптаЗагрузкаКонтрагентов = "/"+НастройкиПодключений.АдресСкриптаЗагрузкаКонтрагентов;
	
	Соединение = мпи_Доработки.СоздатьHTTPСоединение(НастройкиПодключений);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресСкриптаЗагрузкаКонтрагентов,Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыПОСТ,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
	//HTTPСоединение = Новый HTTPСоединение(Адрес); 
	//HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	
	
	_Текст = Новый ТекстовыйДокумент;
	_Текст.ДобавитьСтроку(ТекстОтвета);
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		_Текст.Записать(СхемаОбмена.ПапкаФайлаЛога + "hs_in_users_answ.json");
	Иначе
		_Текст.Записать(ПолучитьИмяВременногоФайла("json"));
	КонецЕсли;
	
	// Нужно удалять глюкавые символосочетания, но не трогать их если есть двойной слеш
	
	_замена = "\f"; 
	
	Если Найти (ТекстОтвета,"\"+_замена) = 0 Тогда 
		ТекстОтвета = СтрЗаменить(ТекстОтвета,_замена,"");
	КонецЕсли;
	
	_замена = "\b"; 
	Если Найти(ТекстОтвета,"\"+_замена) = 0 Тогда 
		ТекстОтвета = СтрЗаменить(ТекстОтвета,_замена,"");
	КонецЕсли;
	
	_замена = "\t"; 
	Если Найти(ТекстОтвета,"\"+_замена) = 0 Тогда 
		ТекстОтвета = СтрЗаменить(ТекстОтвета,_замена,"");
	КонецЕсли;
	
	ЧтениеДЖС = Новый ЧтениеJSON;
	ЧтениеДЖС.УстановитьСтроку(ТекстОтвета);
	
	//Если Не ЗначениеЗаполнено(ТекстОтвета) Тогда
	//	Прервать;
	//КонецЕсли;	
	
	Строки = ПрочитатьJSON(ЧтениеДЖС);
	
	Если НЕ (Строки.status = "OK") Тогда
		Сообщить("Ошибка.");
		Возврат;
	КонецЕсли;
	
	мКонтрагенты = Строки.response.users;
	Для каждого текКонтрагент Из мКонтрагенты Цикл
 		//ищем контрагента по ид
		контр = НайтиЭлементСПР("Контрагенты","сви_КодВэбСинхронизации",текКонтрагент.id);
		Если ЗначениеЗаполнено(контр) Тогда //нашли
			Если НЕ Обновить Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураКонтрагента = Новый Структура;
		СтруктураКонтрагента.Вставить("Обновить",Обновить);
		СтруктураКонтрагента.Вставить("сви_КодВэбСинхронизации",текКонтрагент.id);
		СтруктураКонтрагента.Вставить("Наименование", СокрЛП(текКонтрагент.title));
		СтруктураКонтрагента.Вставить("НаименованиеПолное",СтруктураКонтрагента.Наименование);
		СтруктураКонтрагента.Вставить("Покупатель", Истина);
		СтруктураКонтрагента.Вставить("ЮрФизЛицо",Перечисления.ЮрФизЛицо.ФизЛицо);
		СтруктураКонтрагента.Вставить("Комментарий","Автоматически создан при импорте с сайта");
		СтруктураКонтрагента.Вставить("Родитель",СхемаОбмена.ГруппаКонтрагентов);
		//
		СтруктураКонтрагента.Вставить("Телефон", ОбработатьТелефон(текКонтрагент.phone));
		СтруктураКонтрагента.Вставить("Емейл", 	СокрЛП(текКонтрагент.email));
		СтруктураКонтрагента.Вставить("Город",  СокрЛП(текКонтрагент.city));
		СтруктураКонтрагента.Вставить("Адрес",  СокрЛП(текКонтрагент.address));
		
		ОбновитьКонтрагента(СтруктураКонтрагента,СхемаОбмена);
		
	КонецЦикла;
	
	
КонецПроцедуры

//ФинЛайт добавление функциональности big_ooo [06.02.2017]
Функция ОбновитьКонтрагента(СтруктураКонтрагента,СхемаОбмена)
	//Возврат;
	//ищем контрагента по ид
	контр = НайтиЭлементСПР("Контрагенты","сви_КодВэбСинхронизации",СтруктураКонтрагента.сви_КодВэбСинхронизации);
	Если Не ЗначениеЗаполнено(контр) Тогда //попрубуем найти по контактам
		Пар = Новый Структура;
		Пар.Вставить("Телефон",СтруктураКонтрагента.Телефон);
		Пар.Вставить("Емейл",СтруктураКонтрагента.Емейл);
		контр = НайтиКонтрагентаПоКонтактам(Пар);
	КонецЕсли;
	
	фСоздавать = Ложь;
	Если ЗначениеЗаполнено(контр) Тогда //нашли
		Если НЕ СтруктураКонтрагента.Обновить Тогда
			Возврат контр;
		КонецЕсли;
	Иначе
		фСоздавать =  Истина;
	КонецЕсли;
	
	Если фСоздавать Тогда
		спрКонтрОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	Иначе
		спрКонтрОбъект = контр.ПолучитьОбъект();
	КонецЕсли;
	//заполняем свойства
	ЗаполнитьЗначенияСвойств(спрКонтрОбъект,СтруктураКонтрагента);
	спрКонтрОбъект.Записать();
	Если фСоздавать Тогда
		ДобавитьОсновнойДоговор(спрКонтрОбъект,СхемаОбмена);
	КонецЕсли;
	
	СпрКонтрагент = спрКонтрОбъект.Ссылка;
	
	// контактная информация
	Если ЗначениеЗаполнено(СтруктураКонтрагента.Телефон) Тогда
		НовКонтакт = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		НовКонтакт.Объект 	= СпрКонтрагент;
		НовКонтакт.Вид 		= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		НовКонтакт.Тип		= Перечисления.ТипыКонтактнойИнформации.Телефон;
		НовКонтакт.Представление = СтруктураКонтрагента.Телефон;
		//
		НовКонтакт.Записать();
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураКонтрагента.Емейл) Тогда
		НовКонтакт = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		НовКонтакт.Объект 	= СпрКонтрагент;
		НовКонтакт.Вид 		= Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами;
		НовКонтакт.Тип		= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		НовКонтакт.Представление = СтруктураКонтрагента.Емейл;
		//
		НовКонтакт.Записать();
	КонецЕсли;
	//адрес
	Если ЗначениеЗаполнено(СтруктураКонтрагента.Адрес) или ЗначениеЗаполнено(СтруктураКонтрагента.Город) Тогда
		НовКонтакт = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		НовКонтакт.Объект 	= СпрКонтрагент;
		НовКонтакт.Вид 		= Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента;
		НовКонтакт.Тип		= Перечисления.ТипыКонтактнойИнформации.Адрес;
		НовКонтакт.Поле4	= СтруктураКонтрагента.Город;
		Если СтруктураКонтрагента.Адрес <> СтруктураКонтрагента.Город Тогда
			НовКонтакт.Поле6	= СтруктураКонтрагента.Адрес;
		КонецЕсли;
		НовКонтакт.Представление = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(НовКонтакт);

		//
		НовКонтакт.Записать();
	КонецЕсли;
	
	Если фСоздавать Тогда
		Сообщить("Создана новый контрагент : "+СпрКонтрагент.Наименование+"("+СпрКонтрагент.Код+")");
	Иначе
		Сообщить("Обновлен контрагент : "+СпрКонтрагент.Наименование+"("+СпрКонтрагент.Код+")");
	КонецЕсли;
	
	Возврат СпрКонтрагент;
		
КонецФункции

// } ФинЛайт big_ooo [06.02.2017]

Процедура ЗагрузкаЗаказов(Обновить=Ложь) Экспорт
	//СхемаОбмена = Подразделение.сви_СхемаОбменаССайтом;
	НастройкиПодключений = СхемаОбмена.НастройкаПодключения;
	
	ТокенРез = мпи_Доработки.ПолучитьТокен_Хорошоп(НастройкиПодключений); 
	
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Сообщить(ТокенРез.Сообщение);
		Возврат;
	КонецЕсли;
	
    ПараметрыПОСТ = "token=#token#&additionalData=true";
    ПараметрыПОСТ = СтрЗаменить(ПараметрыПОСТ,"#token#",ТокенСтр);
    Если ЗначениеЗаполнено(Дата1) Тогда
    	ПараметрыПОСТ = ПараметрыПОСТ+"&from="+Формат(Дата1, "ДФ=dd.MM.yyyy")
    КонецЕсли;
    Если ЗначениеЗаполнено(Дата2) Тогда
    	ПараметрыПОСТ = ПараметрыПОСТ+"&to="+Формат(Дата2, "ДФ=dd.MM.yyyy")
    КонецЕсли;
		
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Language", "ru");
	Заголовки.Вставить("Accept-Charset",  "UTF-8");
	Заголовки.Вставить("Content-Language","ru");
	Заголовки.Вставить("Content-Charset", "UTF-8");
	Заголовки.Вставить("Content-Type",    "application/x-www-form-urlencoded; charset=UTF-8");
	
	АдресСкрипта = "/"+НастройкиПодключений.АдресСкриптаЗагрузкаЗаказов;
	
	Соединение = мпи_Доработки.СоздатьHTTPСоединение(НастройкиПодключений);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресСкрипта,Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыПОСТ,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
	
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	
	_Текст = Новый ТекстовыйДокумент;
	_Текст.ДобавитьСтроку(ТекстОтвета);
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		_Текст.Записать(СхемаОбмена.ПапкаФайлаЛога + "hs_orders_answ.json");
	Иначе
		_Текст.Записать(ПолучитьИмяВременногоФайла("json"));
	КонецЕсли;
	
	ЧтениеДЖС = Новый ЧтениеJSON;
	ЧтениеДЖС.УстановитьСтроку(ТекстОтвета);
	
	Строки = ПрочитатьJSON(ЧтениеДЖС);
	
	Если НЕ (Строки.status = "OK") Тогда
		Сообщить("Ошибка. "+Строки.response.message);
		Возврат;
	КонецЕсли;
	
	МассивЗаказов = Строки.response.orders;
	Для Каждого узЗаказ ИЗ МассивЗаказов Цикл
		ИДЗаказа = мпи_Доработки.УбратьШлакИзСтроки(узЗаказ.order_id);
		
		//ТекстЗапроса = "ВЫБРАТЬ
		//               |	ЗаказПокупателя.Ссылка
		//               |ИЗ
		//               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		//               |ГДЕ
		//               |	ЗаказПокупателя.сви_КодВэбСинхронизации = &КодВэбСинхронизации
		//               |	И ЗаказПокупателя.Подразделение = &Подразделение" 
					   
					   	ТекстЗапроса = "ВЫБРАТЬ
		               |	ЗаказПокупателя.Ссылка
		               |ИЗ
		               |	Документ.ПредЗаказ КАК ЗаказПокупателя
		               |ГДЕ
		               |	ЗаказПокупателя.сви_КодВэбСинхронизации = &КодВэбСинхронизации
		               |	И ЗаказПокупателя.Подразделение = &Подразделение"

		;
		//
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("КодВэбСинхронизации",ИДЗаказа);
		Запрос.УстановитьПараметр("Подразделение",Подразделение);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Продолжить; 
		КонецЕсли;
		//контрагент
		СтруктураКонтрагента = Новый Структура;
		СтруктураКонтрагента.Вставить("Обновить",Ложь);
		СтруктураКонтрагента.Вставить("сви_КодВэбСинхронизации",узЗаказ.user);
		СтруктураКонтрагента.Вставить("Наименование", СокрЛП(узЗаказ.delivery_name));
		СтруктураКонтрагента.Вставить("НаименованиеПолное",СтруктураКонтрагента.Наименование);
		СтруктураКонтрагента.Вставить("Покупатель", Истина);
		СтруктураКонтрагента.Вставить("ЮрФизЛицо",Перечисления.ЮрФизЛицо.ФизЛицо);
		СтруктураКонтрагента.Вставить("Комментарий","Автоматически создан при импорте с сайта");
		СтруктураКонтрагента.Вставить("Родитель",СхемаОбмена.ГруппаКонтрагентов);
		
		СтруктураКонтрагента.Вставить("Телефон",ОбработатьТелефон(узЗаказ.delivery_phone));
		СтруктураКонтрагента.Вставить("Емейл",СокрЛП(узЗаказ.delivery_email));
		СтруктураКонтрагента.Вставить("Город",СокрЛП(узЗаказ.delivery_city));
		СтруктураКонтрагента.Вставить("Адрес",СокрЛП(узЗаказ.delivery_address));
		
		//СпрКонтрагент = ОбновитьКонтрагента(СтруктураКонтрагента,СхемаОбмена);
		
		//заказ
		Инфо         = СокрЛП(узЗаказ.comment);
	    ДоставкаИд     = мпи_Доработки.УбратьШлакИзСтроки(узЗаказ.delivery_type.id);
	    СпособОплатыИд = мпи_Доработки.УбратьШлакИзСтроки(узЗаказ.payment_type.id);
		ДоставкаНаименование     = мпи_Доработки.УбратьШлакИзСтроки(узЗаказ.delivery_type.title);
	    СпособОплатыНаименование = мпи_Доработки.УбратьШлакИзСтроки(узЗаказ.payment_type.title);
		//
		ДД = узЗаказ.stat_created;
		Год  = Лев(ДД,4);
		Мес  = Сред(ДД,6,2);
		День = Сред(ДД,9,2);
		Час  = Сред(ДД,12,2);
		Мин  = Сред(ДД,15,2);
		Сек  = Прав(ДД,2);
		ДатаЗаказа = Дата(Год,Мес,День,Час,Мин,Сек);
		
		//с.д.(
		//НовДок = Документы.ЗаказПокупателя.СоздатьДокумент();
		////Значения по умолчанию
		////НовДок.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ПродажаКомиссия;
		//НовДок.Организация = СхемаОбмена.Организация;
		//НовДок.УчитыватьНДС		= Истина;
		//НовДок.СуммаВключаетНДС = Истина;
		////данные с сайта
		//НовДок.Дата        				= ДатаЗаказа;
		//НовДок.сви_КодВэбСинхронизации 	= ИДЗаказа;
		//НовДок.Контрагент 				= СпрКонтрагент;
		//НовДок.ДоговорКонтрагента 		= СпрКонтрагент.ОсновнойДоговорКонтрагента;
		//НовДок.АдресДоставки 			= СтруктураКонтрагента.Адрес;
		//НовДок.Комментарий 				= "Автоматически создан при импорте с сайта заказа № "+ИДЗаказа+"."+Инфо;
		//НовДок.сви_ТипДоставки	        = узЗаказ.delivery_type.title;
		//НовДок.сви_ТипОплаты				= узЗаказ.payment_type.title;
		//НовДок.сви_ГородДоставки			= СтруктураКонтрагента.Город;
		//НовДок.сви_АдресДоставки			= СтруктураКонтрагента.Адрес;
		//НовДок.сви_КомментарийПользователя= узЗаказ.comment;
		//НовДок.Подразделение			= Подразделение;
		//
		//типКупона 						= узЗаказ.coupon_type;
		//Если типКупона=0 Тогда
		//	типКупона = "Без купона";
		//ИначеЕсли типКупона=1 Тогда 
		//	типКупона = "Сертификат на сумму";
		//ИначеЕсли типКупона=2 Тогда 
		//	типКупона = "Многоразовый купон на скидку";
		//КонецЕсли;
		//НовДок.сви_ТипКупонаНаСкидку		= типКупона;
		////валюта
		//валютаСайт = узЗаказ.currency;
		//Если валютаСайт = "UAH" Тогда
		//	НовДок.ВалютаДокумента = НовДок.мВалютаРегламентированногоУчета;
		//	НовДок.КурсВзаиморасчетов = 1;
		//	НовДок.КратностьВзаиморасчетов = 1;
		//Иначе
		//	НовДок.ВалютаДокумента = НайтиВСпрПоНаим("Валюты",валютаСайт);
		//	СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, НовДок.Дата);
		//	НовДок.КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;
		//	НовДок.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
		//КонецЕсли;
		
		//ЗаполнитьТовары(НовДок,узЗаказ,СхемаОбмена);

		
		
		НовДок = Документы.ПредЗаказ.СоздатьДокумент();
		//Значения по умолчанию
		//НовДок.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ПродажаКомиссия;
		НовДок.Организация = СхемаОбмена.Организация;
		//НовДок.УчитыватьНДС		= Истина;
		//НовДок.СуммаВключаетНДС = Истина;
		//данные с сайта
		НовДок.Дата        				= ДатаЗаказа;
		НовДок.сви_КодВэбСинхронизации 	= ИДЗаказа;
		НовДок.ЮрФизЛицо  				= Перечисления.ЮрФизЛицо.ФизЛицо;
		//НовДок.Контрагент 				= СпрКонтрагент;
		//НовДок.ДоговорКонтрагента 		= СпрКонтрагент.ОсновнойДоговорКонтрагента;
		НовДок.АдресДоставки 			= СтруктураКонтрагента.Адрес;
		НовДок.Комментарий 				= "Автоматически создан при импорте с сайта("+НастройкиПодключений.Адрес+") заказа № "+ИДЗаказа+"."+Инфо+
		Символы.ПС + "" + СтруктураКонтрагента.Наименование + "   " +  СтруктураКонтрагента.Телефон;
		НовДок.сви_ТипДоставки	        = узЗаказ.delivery_type.title;
		НовДок.сви_ТипОплаты				= узЗаказ.payment_type.title;
		НовДок.сви_ГородДоставки			= СтруктураКонтрагента.Город;
		НовДок.сви_АдресДоставки			= СтруктураКонтрагента.Адрес;
		НовДок.сви_КомментарийПользователя= узЗаказ.comment;
		НовДок.Подразделение			= Подразделение;  
		НовДок.Статус = Справочники.Статусы.НайтиПоКоду("000000055");
        типКупона 						= узЗаказ.coupon_type;  
		
		НП_APIКлюч = МодульНовойПошты_СД.ПолучитьAPIКлючПоДате(НовДок.Дата);
		Если не НП_APIКлюч = "" Тогда
			НастройкиAPIКлюча = МодульНовойПошты_СД.ПолучитьНастройкиПоAPIКлючу(НП_APIКлюч);
			Если Не НастройкиAPIКлюча = Неопределено Тогда
				НовДок.НП_КонтрольОплаты = НастройкиAPIКлюча.НП_КонтрольОплаты;				
			КонецЕсли;
		КонецЕсли;

		Если типКупона=0 Тогда
			типКупона = "Без купона";
		ИначеЕсли типКупона=1 Тогда 
			типКупона = "Сертификат на сумму";
		ИначеЕсли типКупона=2 Тогда 
			типКупона = "Многоразовый купон на скидку";
		КонецЕсли;
		НовДок.сви_ТипКупонаНаСкидку		= типКупона;
		//Если валютаСайт = "UAH" Тогда
		//	НовДок.ВалютаДокумента = НовДок.мВалютаРегламентированногоУчета;
		//	НовДок.КурсВзаиморасчетов = 1;
		//	НовДок.КратностьВзаиморасчетов = 1;
		//Иначе
		//	НовДок.ВалютаДокумента = НайтиВСпрПоНаим("Валюты",валютаСайт);
		//	СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(НовДок.ВалютаДокумента, НовДок.Дата);
		//	НовДок.КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;
		//	НовДок.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
		//КонецЕсли;   
		
		ТекНомМенеджер = константы.ТекущийМенеджерХорошоп_СД.Получить();
		Константы.ТекущийМенеджерХорошоп_СД.Установить(ТекНомМенеджер+1);
		Мен = Константы.ТекущийМенеджерХорошоп_СД.Получить();
		Док = Документы.ГрафикРаботыМенеджеров_Хорошоп.Выбрать(ТекущаяДата()-90*24*60*60,ТекущаяДата()+90*24*60*60);
		Пока Док.Следующий() Цикл
			Если Док.Проведен Тогда
				Если Док.ДатаПо >= ТекущаяДата() и Док.Дата <= ТекущаяДата()  Тогда
					
					Кво = Док.Менеджера.Количество();
					Поз = Мен-Цел(Мен/Кво)*Кво;
					Если Поз = 0 Тогда
						Поз = Кво;
					КонецЕсли; 
					НовДок.Ответственный = Док.Менеджера.Получить(Поз-1).Менеджер;
					НовДок.ОтветственныйМенеджер = Док.Менеджера.Получить(Поз-1).Менеджер;
					
					ПрерватЬ;
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла; 

		
		
		ЗаполнитьТовары_ПредЗаказ_СД(НовДок,узЗаказ,СхемаОбмена); 
		Попытка
			Гараж.ЗаполнитьДопУслугиПредЗаказа(НовДок);
		Исключение КонецПопытки;
		//с.д.)
		
		
		НовДок.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("Создан документ "+НовДок.Ссылка);
		
		//ОбработкаПрерыванияПользователя();
	КонецЦикла;

КонецПроцедуры

//ФинЛайт добавление функциональности big_ooo [25.01.2017]
Процедура ЗаполнитьТовары(ДокОб,заказСайт,СхемаОбмена)
	ДокОб.Товары.Очистить();
	ДокОб.Услуги.Очистить();
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	//ПроцентСкидки = заказСайт.discount_percent+заказСайт.coupon_percent; 
	//
	Всего = 0;
	СуммаПоТоварам = 0;
	Если ИмяРеквизитаИдентификатора = "Штрихкод" Тогда
		ШтрихкодыЗаказа = Новый Массив;
		Для Каждого узСтрокаЗаказа Из заказСайт.products Цикл
			ШтрихкодыЗаказа.Добавить(узСтрокаЗаказа.article);
		КонецЦикла;	
		ЗапросШтрихкодов = Новый Запрос;
		ЗапросШтрихкодов.Текст =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод,
		|	Штрихкоды.Владелец,
		|	Штрихкоды.ХарактеристикаНоменклатуры
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды ГДЕ Штрихкоды.Штрихкод В (&ШтрихкодыЗаказа)";
		ЗапросШтрихкодов.УстановитьПараметр("ШтрихкодыЗаказа", ШтрихкодыЗаказа);
		ТаблШтрихкодов = ЗапросШтрихкодов.Выполнить().Выгрузить();
	КонецЕсли;	 
	Для Каждого узСтрокаЗаказа Из заказСайт.products Цикл
		Если узСтрокаЗаказа.discount_marker = "PRODUCTS_SET" ТОгда
			Продолжить;
		КонецЕсли;	
		НовСтр 		= ДокОб.Товары.Добавить();
		КодТовара 	= мпи_Доработки.УбратьШлакИзСтроки(узСтрокаЗаказа.article);
		Цена      	= Число(узСтрокаЗаказа.price);
		Кво       	= Число(узСтрокаЗаказа.quantity);
		Если ИмяРеквизитаИдентификатора = "Штрихкод" Тогда
			СтрокаШК = ТаблШтрихкодов.Найти(КодТовара, "Штрихкод");
			Если СтрокаШК = Неопределено Тогда
				Товар 		= Справочники.Номенклатура.ПустаяСсылка();	
				Характеристика = Неопределено;
			Иначе
				Товар = СтрокаШК.Владелец;
				Характеристика = СтрокаШК.ХарактеристикаНоменклатуры;
			КонецЕсли;	
		Иначе	
			Товар 		= НайтиЭлементСПР("Номенклатура",ИмяРеквизитаИдентификатора,КодТовара);	
			Характеристика = Неопределено;
			Если НЕ ЗначениеЗаполнено(Товар) Тогда
				Характеристика = НайтиЭлементСПР("ХарактеристикиНоменклатуры", "сви_КодВэбСинхронизации", КодТовара);	
				Если ЗначениеЗаполнено(Характеристика) Тогда
					Товар = Характеристика.Владелец;
				Иначе	
					Сообщить("Внимание! Не найден товар "+узСтрокаЗаказа.title+" артикул ("+узСтрокаЗаказа.article+")");
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
		НовСтр.Номенклатура = Товар;
		ДокОб.ПриИзмененииНоменклатурыТоваров(НовСтр);
		НовСтр.ХарактеристикаНоменклатуры = Характеристика;
		НовСтр.Количество 	= Кво;
		НовСтр.Цена 		= Цена;
		//НовСтр.ПроцентСкидкиНаценки  = ПроцентСкидки;
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтр, ДокОб);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтр, ДокОб);
		СуммаПоТоварам = СуммаПоТоварам + НовСтр.Сумма;
	КонецЦикла;
	//добавим доставку
	СтоимостьДоставки = заказСайт.delivery_price;
	Если СтоимостьДоставки > 0 Тогда
		НовСтр = ДокОб.Услуги.Добавить();
		НовСтр.Номенклатура = СхемаОбмена.НоменклатураДоставка;
		// Заполняем реквизиты табличной части.
		ОбработкаТабличныхЧастей.ЗаполнитьСодержаниеТабЧасти(НовСтр, ДокОб);
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НовСтр, ДокОб, "Реализация");

		НовСтр.Количество 	= 1;
		НовСтр.Цена 		= СтоимостьДоставки;
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтр, ДокОб);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтр, ДокОб);
	КонецЕсли;
	//добавим общую скидку в заказ
	сумСкидки = СуммаПоТоварам - заказСайт.total_sum;
	Если сумСкидки <> 0 Тогда
		СуммаСкидкиРаспред = сумСкидки;
		НакопительныйИтог = ДокОб.Товары.Итог("Сумма");
		Для Каждого ТекСтр Из ДокОб.Товары цикл
			Если НакопительныйИтог = 0 Тогда 
				Прервать;
			КонецЕсли;	
			Если ТекСтр.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;	
			ТекСуммаСкидки = СуммаСкидкиРаспред * ТекСтр.Сумма / НакопительныйИтог;
			СуммаСкидкиРаспред = СуммаСкидкиРаспред - ТекСуммаСкидки;
			НакопительныйИтог = НакопительныйИтог - ТекСтр.Сумма;
			ТекСтр.ПроцентСкидкиНаценки = 100 * ТекСуммаСкидки / ТекСтр.Сумма;
			ТекСтр.Сумма = ТекСтр.Сумма - ТекСуммаСкидки;
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(ТекСтр, ДокОб);
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьТовары_ПредЗаказ_СД(ДокОб,заказСайт,СхемаОбмена)
	ДокОб.Товары.Очистить();
	ДокОб.Услуги.Очистить();
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	//ПроцентСкидки = заказСайт.discount_percent+заказСайт.coupon_percent; 
	//
	Всего = 0;
	СуммаПоТоварам = 0;
	Если ИмяРеквизитаИдентификатора = "Штрихкод" Тогда
		ШтрихкодыЗаказа = Новый Массив;
		Для Каждого узСтрокаЗаказа Из заказСайт.products Цикл
			ШтрихкодыЗаказа.Добавить(узСтрокаЗаказа.article);
		КонецЦикла;	
		ЗапросШтрихкодов = Новый Запрос;
		ЗапросШтрихкодов.Текст =
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод,
		|	Штрихкоды.Владелец,
		|	Штрихкоды.ХарактеристикаНоменклатуры
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды ГДЕ Штрихкоды.Штрихкод В (&ШтрихкодыЗаказа)";
		ЗапросШтрихкодов.УстановитьПараметр("ШтрихкодыЗаказа", ШтрихкодыЗаказа);
		ТаблШтрихкодов = ЗапросШтрихкодов.Выполнить().Выгрузить();
	КонецЕсли;	 
	Для Каждого узСтрокаЗаказа Из заказСайт.products Цикл
		Если узСтрокаЗаказа.discount_marker = "PRODUCTS_SET" ТОгда
			Продолжить;
		КонецЕсли;	
		НовСтр 		= ДокОб.Товары.Добавить();
		КодТовара 	= мпи_Доработки.УбратьШлакИзСтроки(узСтрокаЗаказа.article);
		Цена      	= Число(узСтрокаЗаказа.price);
		Кво       	= Число(узСтрокаЗаказа.quantity);
		Если ИмяРеквизитаИдентификатора = "Штрихкод" Тогда
			СтрокаШК = ТаблШтрихкодов.Найти(КодТовара, "Штрихкод");
			Если СтрокаШК = Неопределено Тогда
				Товар 		= Справочники.Номенклатура.ПустаяСсылка();	
				Характеристика = Неопределено;
			Иначе
				Товар = СтрокаШК.Владелец;
				Характеристика = СтрокаШК.ХарактеристикаНоменклатуры;
			КонецЕсли;	
		Иначе	
			Товар 		= НайтиЭлементСПР("Номенклатура",ИмяРеквизитаИдентификатора,КодТовара);	
			Характеристика = Неопределено;
			Если НЕ ЗначениеЗаполнено(Товар) Тогда
				Характеристика = НайтиЭлементСПР("ХарактеристикиНоменклатуры", "сви_КодВэбСинхронизации", КодТовара);	
				Если ЗначениеЗаполнено(Характеристика) Тогда
					Товар = Характеристика.Владелец;
				Иначе	
					Сообщить("Внимание! Не найден товар "+узСтрокаЗаказа.title+" артикул ("+узСтрокаЗаказа.article+")");
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
		НовСтр.Номенклатура = Товар;
		//ДокОб.ПриИзмененииНоменклатурыТоваров(НовСтр);
		//НовСтр.ХарактеристикаНоменклатуры = Характеристика;
		НовСтр.Количество 	= Кво;
		НовСтр.Цена 		= Цена;
		НовСтр.Сумма = НовСтр.Цена * НовСтр.Количество;
		НовСтр.СуммаСоСкидкой = НовСтр.Сумма;
	КонецЦикла;
	//добавим доставку
	СтоимостьДоставки = заказСайт.delivery_price;
	Если СтоимостьДоставки > 0 Тогда
		НовСтр = ДокОб.Услуги.Добавить();
		НовСтр.Номенклатура = СхемаОбмена.НоменклатураДоставка;
		// Заполняем реквизиты табличной части.
		//ОбработкаТабличныхЧастей.ЗаполнитьСодержаниеТабЧасти(НовСтр, ДокОб);
		//ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НовСтр, ДокОб, "Реализация");

		НовСтр.Количество 	= 1;
		НовСтр.Цена 		= СтоимостьДоставки;
		//ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтр, ДокОб);
		//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтр, ДокОб);
		НовСтр.Сумма = НовСтр.Цена * НовСтр.Количество;  
		
	КонецЕсли;
	//добавим общую скидку в заказ
	//сумСкидки = СуммаПоТоварам - заказСайт.total_sum;
	//Если сумСкидки <> 0 Тогда
	//	СуммаСкидкиРаспред = сумСкидки;
	//	НакопительныйИтог = ДокОб.Товары.Итог("Сумма");
	//	Для Каждого ТекСтр Из ДокОб.Товары цикл
	//		Если НакопительныйИтог = 0 Тогда 
	//			Прервать;
	//		КонецЕсли;	
	//		Если ТекСтр.Сумма = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		ТекСуммаСкидки = СуммаСкидкиРаспред * ТекСтр.Сумма / НакопительныйИтог;
	//		СуммаСкидкиРаспред = СуммаСкидкиРаспред - ТекСуммаСкидки;
	//		НакопительныйИтог = НакопительныйИтог - ТекСтр.Сумма;
	//		ТекСтр.ПроцентСкидкиНаценки = 100 * ТекСуммаСкидки / ТекСтр.Сумма;
	//		ТекСтр.Сумма = ТекСтр.Сумма - ТекСуммаСкидки;
	//		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(ТекСтр, ДокОб);
	//	КонецЦикла;	
	//КонецЕсли;
КонецПроцедуры

//ФинЛайт добавление функциональности big_ooo [13.01.2017]
Функция НайтиВСпрПоНаим(имяСпр,наим)
	
	НайденныйЭл = Справочники [имяСпр].НайтиПоНаименованию(наим);
	Если НЕ ЗначениеЗаполнено(НайденныйЭл) Тогда
		спрОб = Справочники [имяСпр].СоздатьЭлемент();
		спрОб.Наименование = наим;
		спрОб.Записать();
		НайденныйЭл = спрОб.Ссылка;
	КонецЕсли;
	Возврат НайденныйЭл;
КонецФункции

//big_ooo добавление функциональности { [18.01.2017]
Функция ОбработатьТелефон(Знач а)
	б = СтрЗаменить(а," ","");
	б = СтрЗаменить(б,"-","");
	б = СтрЗаменить(б,"+","");
	б = СтрЗаменить(б,"(","");
	б = СтрЗаменить(б,")","");
	б = СтрЗаменить(б,".","");
	б = СтрЗаменить(б,Символы.НПП,"");
	б = СокрЛП(б);
	Возврат б;
КонецФункции


// } ФинЛайт big_ooo [13.01.2017]


Функция НайтиЭлементСПР(ИмяСпр,ИмяРеквизитаИдентификатора,ИД) Экспорт
	Если ИмяРеквизитаИдентификатора = "Штрихкод" Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Штрихкоды.Владелец КАК Ссылка
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод = &ИД
		|	И Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура";
	Иначе	
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	спр.Ссылка
		|ИЗ
		|	Справочник.#ИмяСпр# КАК спр
		|ГДЕ
		|	спр.ЭтоГруппа = Ложь
		|	И спр.#ИмяРеквизита# = &ИД"
		;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#ИмяРеквизита#",ИмяРеквизитаИдентификатора);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#ИмяСпр#",ИмяСпр);
		
		Если НЕ Метаданные.Справочники[ИмяСпр].Иерархический Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "спр.ЭтоГруппа = Ложь", "Истина");
		КонецЕсли;	
	КонецЕсли;
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ИД",ИД);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;	
	Возврат Неопределено;
КонецФункции

//ФинЛайт добавление функциональности big_ooo [18.01.2017]
Функция НайтиКонтрагентаПоКонтактам(Пар) Экспорт
	
	Рез = Справочники.Контрагенты.ПустаяСсылка();
	
	СпКонтакты = Новый СписокЗначений;
	
	Телефон = "";
	Если Пар.Свойство("Телефон",Телефон) Тогда
		Если ЗначениеЗаполнено(Телефон) Тогда
//			Телефон = ВзаимодействияКлиентСервер.ОбработатьТелефон(Телефон);
			СпКонтакты.Добавить(Телефон);
		КонецЕсли;
	КонецЕсли;
	
	Емейл = "";
	Если Пар.Свойство("Емейл",Емейл) Тогда
		Если ЗначениеЗаполнено(Емейл) Тогда
			СпКонтакты.Добавить(Емейл);
		КонецЕсли;
	КонецЕсли;
	
	Если СпКонтакты.Количество() = 0 Тогда Возврат Рез; КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КонтактыКонтрагентов.Объект,
	               |	КонтактыКонтрагентов.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактыКонтрагентов
	               |ГДЕ
	               |	ВЫРАЗИТЬ(КонтактыКонтрагентов.Представление КАК СТРОКА(200)) В (&Информация)
	               |	И КонтактыКонтрагентов.Объект.ПометкаУдаления = ЛОЖЬ"
	               ;
	//
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Информация",СпКонтакты);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			Возврат Выборка.Объект;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

//ФинЛайт добавление функциональности big_ooo [18.01.2017]
Процедура ДобавитьОсновнойДоговор(спрКонтрагентОб,СхемаОбмена)
	// Создадим Основной Договор, ВидыВзаиморасчетов - ПоСделкам (УТ), Владелец - Контрагент
	Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	Договор.Владелец 				= спрКонтрагентОб.Ссылка;
	Договор.Наименование 			= НСтр("ru='Основной договор';uk='Основний договір'");
	// валюта принимаем равной валюте счета, к-ый указан при импорте
	Договор.ВалютаВзаиморасчетов 	= Константы.ВалютаРегламентированногоУчета.Получить();
		
	ВидДоговора 					= Перечисления.ВидыДоговоровКонтрагентов.СПокупателем; 
	
	Договор.ВидДоговора 			= ВидДоговора;
	
	//+БП: d.matyash (23.10.2024) <>
	Договор.БП_ТипДоговора 			= Справочники.БП_ТипыДоговоровКонтрагентов.Стандартный;	
	//-БП: d.matyash (23.10.2024) <>

	//Договор.Номер					= СтруктураЗаполнения.Номер;
	//Договор.Дата					= СтруктураЗаполнения.Дата;
	
	Договор.ВедениеВзаиморасчетов 	= Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
	
	Договор.СхемаНалоговогоУчета    = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;

	Договор.Организация 			= СхемаОбмена.Организация; //УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");

	Договор.Комментарий = НСтр("ru='Автоматически создан при импорте с сайта';uk='Автоматично створений при імпорті із сайта'");
	Договор.Записать();
	
	// в созданном Контрагенте, дополним поле "ОсновнойДоговорКонтрагента"
	спрКонтрагентОб.ОсновнойДоговорКонтрагента 		= Договор.Ссылка;
	спрКонтрагентОб.Записать();	
КонецПроцедуры


Процедура ЗагрузкаИУстановкаКатегорийНоменклатуры() Экспорт
	
	Если СхемаОбмена.ХранениеКатегорийСайта <> Перечисления.сви_ВидыХраненияКатегорийСайта.КатегорииНоменклатуры Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПодключений = СхемаОбмена.НастройкаПодключения;
	
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	тТовары = ПолучитьНоменклатуруССайта(Истина);
	
	Если тТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КвоНовых = 0;
	
	ВидКатегорий = СхемаОбмена.ВидКатегорийНоменклатуры;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мпи_КатегорииНоменклатуры.КодВэбСинхронизации,
	|	мпи_КатегорииНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.мпи_КатегорииНоменклатуры КАК мпи_КатегорииНоменклатуры
	|ГДЕ
	|	мпи_КатегорииНоменклатуры.Владелец = &Владелец
	|	И мпи_КатегорииНоменклатуры.КодВэбСинхронизации <> """"";
	Запрос.УстановитьПараметр("Владелец", ВидКатегорий);
	ТаблКатегорий = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр ИЗ тТовары Цикл
		Товар = НайтиЭлементСПР("Номенклатура",ИмяРеквизитаИдентификатора,Стр.ИД);
		Если НЕ  ЗначениеЗаполнено(Товар) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.КодРодителя) Тогда
			СтрокаТаблКатегорий = ТаблКатегорий.Найти(Стр.КодРодителя, "КодВэбСинхронизации");
			Если СтрокаТаблКатегорий <> Неопределено Тогда
					//Проверим. Если Есть несколько категорий, то надо для первой основную установить
					НЗ = РегистрыСведений.мпи_ЗначенияКатегорийНоменклатуры.СоздатьНаборЗаписей();
					НЗ.Отбор.НоменклатураОбъект.Установить(СтрокаТаблКатегорий.Ссылка);
					НЗ.Прочитать();
					Если НЗ.Количество() Тогда
						Основная = Ложь;
					Иначе
						Основная = Истина;
					КонецЕсли;	
				
				МЗ = РегистрыСведений.мпи_ЗначенияКатегорийНоменклатуры.СоздатьМенеджерЗаписи();
				МЗ.НоменклатураОбъект = Товар;
				МЗ.ВидКатегории = ВидКатегорий;
				МЗ.Значение = СтрокаТаблКатегорий.Ссылка;
				МЗ.Основная = Основная;
				МЗ.Записать();
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
